Repository: avify-com/avify-wordpress-plugin
Catalog: languages/avify-payments-*.po
Languages: es_cr

source: Connect your WooCommerce account to Avify and send all your orders to one centralized inventory
es_cr: Conecta tu cuenta de WooCommerce a Avify y envía todos tus pedidos a un inventario centralizado

source: Credit card
es_cr: Tarjeta de Crédito

source: Enabled / Disabled
es_cr: Activado / Desactivado

source: Activate this payment method
es_cr: Activar este método de pago

source: Payment Method Title
es_cr: Título del método de pago

source: Title to display for the payment method
es_cr: Título que se mostrará para el método de pago

source: Card
es_cr: Tarjeta

source: Description
es_cr: Descripción

source: Payment Description
es_cr: Descripción del pago

source: Pay with your debit or credit card
es_cr: Paga con tu tarjeta de débito o crédito

source: Banking detail (22 characters max)
es_cr: Detalle bancario (máximo 22 caracteres)

source: Detail that appears on the client's bank account statement
es_cr: Detalle que aparece en el estado de cuenta del cliente

source: API Mode
es_cr: Modo de API

source: Avify API Mode
es_cr: Modo de Avify API

source: API Version
es_cr: Versión de API

source: Avify API Version
es_cr: Versión de Avify API

source: Charge Description
es_cr: Descripción del cargo

source: Online Purchase
es_cr: Compra en línea

source: It is the default description of a charge (purchase) to your client's card
es_cr: Es la descripción predeterminada de un cargo (compra) a la tarjeta de tu cliente

source: Store ID
es_cr: ID de la tienda

source: Unique identifier of your store
es_cr: Identificador único de tu tienda

source: API Client Secret provided by Avify
es_cr: API Client Secret proporcionado por Avify

source: An error occurred while connecting to Avify
es_cr: Se ha producido un error al conectarse con Avify

source: Something went wrong
es_cr: Parece que algo salió mal

source: Payment completed successfully
es_cr: Pago completado con éxito

source: Card holder, card number, expiry and CVC are required fields
es_cr: Nombre, número de tarjeta, fecha de expiración y CVC son campos obligatorios

source: Card expiration month is invalid
es_cr: El mes de vencimiento de la tarjeta no es válido

source: Card expiration year is invalid
es_cr: El año de vencimiento de la tarjeta no es válido

source: Card security code must have 3 or 4 digits
es_cr: El código de seguridad de la tarjeta debe tener 3 o 4 dígitos

source: Card Verification Code
es_cr: Código de verificación

source: Card holder
es_cr: Nombre

source: Card number
es_cr: Número de tarjeta

source: Expiry (MM/YY)
es_cr: Fecha de expiración

source: MM / YY
es_cr: MM/AA

source: Settings
es_cr: Ajustes
